In [1]:
import numpy as np
import pandas as pd

In [23]:
randomarray52 = np.array(np.random.randint(1,100,(5,2)))
randomarray52

array([[91, 35],
       [92, 61],
       [58, 64],
       [28, 24],
       [60, 91]])

In [76]:
df = pd.DataFrame(randomarray52)
df

    0   1
0  91  35
1  92  61
2  58  64
3  28  24
4  60  91

In [78]:
help(df.idxmax)

Help on method idxmax in module pandas.core.frame:

idxmax(axis=0, skipna=True) -> pandas.core.series.Series method of pandas.core.frame.DataFrame instance
    Return index of first occurrence of maximum over requested axis.

    NA/null values are excluded.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        The axis to use. 0 or 'index' for row-wise, 1 or 'columns' for column-wise.
    skipna : bool, default True
        Exclude NA/null values. If an entire row/column is NA, the result
        will be NA.

    Returns
    -------
    Series
        Indexes of maxima along the specified axis.

    Raises
    ------
    ValueError
        * If the row/column is empty

    See Also
    --------
    Series.idxmax

    Notes
    -----
    This method is the DataFrame version of ``ndarray.argmax``.

In [35]:
df

Empty DataFrame
Columns: []
Index: []

In [38]:
fruit_sales = pd.DataFrame({"Apples": [35,41], "Bananas":[21,34]}, index=["2017 Sales", "2018 Sales"])
fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [41]:
ss = {'a': 10, 'b': 20}
ingredients = pd.Series({'Flour': '4 cups', 'Milk': '1 cup', 'Eggs': '2 large', 'Spam': '1 can'}, name='Dinner')
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [50]:
fruit_sales.loc["2017 Sales": "2018 Sales"]

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [54]:
fruit_sales.reset_index(inplace=True)

In [60]:
fruit_sales.drop('index', axis=1, inplace = True)

In [62]:
fruit_sales.Apples > 40

0    False
1     True
Name: Apples, dtype: bool

In [70]:
fruit_sales.iloc[[0,1]]

   Apples  Bananas
0      35       21
1      41       34

In [75]:
df = pd.DataFrame({
    'country': ['Italy', 'Portugal', 'US', 'US'],
    'province': ['Sicily & Sardina', 'Douro', 'California', 'New York'],
    'region_1' : ['Etna', np.nan ,'Napa Valley', 'Finger Lakes'],
    'region_2': [np.nan ,np.nan,'Napa', 'Finger Lakes']
}, index = [0,1,10,100])
df

      country          province      region_1      region_2
0       Italy  Sicily & Sardina          Etna           NaN
1    Portugal             Douro           NaN           NaN
10         US        California   Napa Valley          Napa
100        US          New York  Finger Lakes  Finger Lakes

In [79]:
fruit_sales

   Apples  Bananas
0      35       21
1      41       34

In [82]:
(fruit_sales.Apples/fruit_sales.Bananas).idxmax()

0

In [83]:
fruit_sales

   Apples  Bananas
0      35       21
1      41       34

In [102]:
def f2(d):
    if(d < 25):
        return d+1
    else:
        return d-1
fruit_sales.Bananas.map(f2)

0    22
1    33
Name: Bananas, dtype: int64

In [98]:
def f1(row):
    if(row.Apples > 35):
        row.Apples = 100
    return row

fruit_sales.apply(f1, axis = 1)

   Apples  Bananas
0      35       21
1     100       34

In [105]:
fruit_sales['Apples'].idxmax()

1

In [106]:
fruit_sales.describe()

           Apples    Bananas
count    2.000000   2.000000
mean    67.500000  27.500000
std     45.961941   9.192388
min     35.000000  21.000000
25%     51.250000  24.250000
50%     67.500000  27.500000
75%     83.750000  30.750000
max    100.000000  34.000000